{
  "General": [
    {
      "q": "Which planet is known as the Red Planet?",
      "a": "Mars",
      "facts": "<h3>Why Mars looks red</h3><ul><li><strong>Rusty dust:</strong> Mars is covered in iron-rich dust that has oxidised, giving the surface a red appearance.</li><li><strong>Thin atmosphere:</strong> Its atmosphere is too thin to hide the surface colour.</li><li><strong>Nicknames:</strong> Because of its colour, many cultures associate Mars with war or fire.</li></ul>"
    },
    {
      "q": "What is the largest ocean on Earth?",
      "a": "The Pacific Ocean",
      "facts": "<h3>The vast Pacific</h3><ul><li><strong>Sheer size:</strong> It covers more than 30% of the Earth's surface.</li><li><strong>Deepest point:</strong> The Mariana Trench, over 11,000 metres deep, lies in the Pacific.</li><li><strong>Ring of Fire:</strong> Many of the world's volcanoes and earthquakes occur around its edges.</li></ul>"
    },
    {
      "q": "In chess, which piece moves in an L-shape?",
      "a": "The knight",
      "facts": "<h3>The tricky knight</h3><ul><li><strong>Unique move:</strong> The knight moves two squares in one direction and then one at a right angle.</li><li><strong>Jumping:</strong> It is the only piece that can jump over other pieces.</li><li><strong>Forks:</strong> Knights are excellent at forking two or more pieces at once.</li></ul>"
    }
  ],
  "Movies": [
    {
      "q": "Who directed the sci‑fi heist movie <em>Inception</em>?",
      "a": "Christopher Nolan",
      "facts": "<h3>Christopher Nolan</h3><ul><li><strong>Mind‑bending style:</strong> Known for complex narratives and practical effects.</li><li><strong>Other hits:</strong> Directed <em>The Dark Knight</em> trilogy, <em>Interstellar</em> and <em>Oppenheimer</em>.</li><li><strong>Sound & visuals:</strong> Often collaborates with composer Hans Zimmer and cinematographer Hoyte van Hoytema.</li></ul>"
    },
    {
      "q": "Which movie popularised the phrase “May the Force be with you”?",
      "a": "Star Wars",
      "facts": "<h3>The Force is strong</h3><ul><li><strong>First appearance:</strong> The line was spoken in the 1977 film <em>Star Wars: A New Hope</em>.</li><li><strong>Cultural impact:</strong> It has become a universal way to wish someone good luck.</li><li><strong>May the 4th:</strong> Fans celebrate “Star Wars Day” on May 4th because it sounds like the phrase.</li></ul>"
    },
    {
      "q": "In the Marvel Cinematic Universe, what is the name of Thor’s hammer?",
      "a": "Mjölnir",
      "facts": "<h3>Mjölnir</h3><ul><li><strong>Worthiness:</strong> Only those who are deemed worthy can lift the hammer.</li><li><strong>Origins:</strong> Based on the hammer from Norse mythology.</li><li><strong>On screen:</strong> Appears in multiple films, including <em>Thor</em>, <em>The Avengers</em>, and <em>Avengers: Endgame</em>.</li></ul>"
    }
  ],
  "Music": [
    {
      "q": "Which musical instrument has 88 keys on a standard modern version?",
      "a": "The piano",
      "facts": "<h3>The modern piano</h3><ul><li><strong>Key count:</strong> 52 white keys and 36 black keys.</li><li><strong>Origins:</strong> Developed from earlier keyboard instruments like the harpsichord.</li><li><strong>Range:</strong> Covers more than seven octaves, making it one of the most versatile instruments.</li></ul>"
    },
    {
      "q": "Which pop star is known as the ‘King of Pop’?",
      "a": "Michael Jackson",
      "facts": "<h3>Michael Jackson</h3><ul><li><strong>Iconic albums:</strong> <em>Thriller</em>, <em>Bad</em>, and <em>Off the Wall</em>.</li><li><strong>Record‑breaking:</strong> <em>Thriller</em> is one of the best‑selling albums of all time.</li><li><strong>Signature moves:</strong> Famous for the moonwalk and gravity‑defying lean.</li></ul>"
    }
  ]
}
